backgroundMesh_CASE/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1100;
        startFace       98875;
    }
    sides
    {
        type            patch;
        nFaces          4650;
        startFace       99975;
    }
    top
    {
        type            patch;
        nFaces          1100;
        startFace       104625;
    }
)

// ************************************************************************* //
