backgroundMesh_CASE/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.sika 0
);

regions
(
    /*
    cylinderToCell
    {
        p1          (0 0 0.012);
        p2          (0 0 0.040);
        radius      0.0035;
        fieldValues
        (
            volScalarFieldValue alpha.sika 1
        );
    }
    */
);


// ************************************************************************* //
